# BASE
ANSWER_IS_EMPTY = "Тут пока пусто"

# KEYBOARD

BUTTON_BACK = "👈 Назад"
BUTTON_ANSWER = "Ответить 😎"


# MENU
MAIN_MENU_TITLE = "Таааакс..., а вот и мое меню 🧾"

# ANSWER
ANSWER_START_MESSAGE = "Если все готово, то ты можешь ответить"
ANSWER_DATA_NOT_EMPTY = (
    "Ой, а я что-то нашел для тебя 🥴 ...\n"
    "Задания на которые ты уже ответил я отметил знаком ✅"
)
ANSWER_HOMEWORKS_IS_EMPTY = "Пока домашних заданий нет 🥳🥳🥳"
START_HOMEWORK_ANSWER = (
    "Если хочешь ответить на задание, присылай фотографии 📸 или документы 📃"
    "Когда закончишь вызови /finish"
)
ANSWER_HOMEWORKS_FINISH = "Все ответы записаны, будем проверять!"
ANSWER_BACKEND_ERROR = (
    "Ой 🤭, а я ничего не нашел, попробуй заново вызвать меню, а я спать пошел 🥱"
)

# REGISTRATION
REGISTRATION_START = "Хм..., а я тебя еще не знаю 🤔, давай познакомимся 🙋"
REGISTRATION_NAME = "Давай запомним твое имя и фамилию ✏"
REGISTRATION_EMAIL = "Супер, теперь мне нужен твой email 📧"
REGISTRATION_INVALID_EMAIL = "Кажется ты ошибся в email😌"
REGISTRATION_SUBJECT = "И последний шаг, напиши что ты изучаешь на занятиях✍"
REGISTRATION_FINISH = "Ну все..., я тебя запомнил, что будем делать дальше?"
REGISTRATION_INVALID = "Хм, у меня не получается тебя сохранить 🙃"

# HOMEWORK
HOMEWORK_CREATE = (
    "👽 Тук-тук-тук проверь список домашних заданий, там появилось что-то новенькое😂"
)
HOMEWORK_STATUS_DONE = "✅"
HOMEWORK_STATUS_NOT_COMPLETED = "❌"
HOMEWORK_STUDENT_ANSWERED = (
    lambda student_full_name="": f"{student_full_name} ответил на задание"
)

# RESOURCES TEXT

ANSWER_RESOURCES = "📚"
